# Lab05 Python Data Science with Pandas

## Please submit your finished lab05 jupyter notebook via pull request in GitHub

In [2]:
# magic command to display matplotlib plots inline within the ipython notebook webpage
%matplotlib inline

# import necessary modules
import pandas as pd, numpy as np, matplotlib.pyplot as plt

Part 1 <br /> Basics of Selecting and Slicing Data

In [3]:
# create a pandas dataframe from the location data set
df = pd.read_csv('data/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [4]:
# Q1: how to get 2 columns from the dataframe (city and country)?
df1 = df[["city", "country"]]

In [5]:
df1.describe()

             city country
count        1759    1759
unique        113      15
top     Barcelona   Spain
freq          632     646

To get a single "cell's" value out of a dataframe, pass a column name, then a row label. This is equivalent to slicing the dataframe down to a single series, then slicing a single value out of that series using [ ] indexing.

In [6]:
# Q2: how to get the first 5 rows of the "city" column?
df1["city"][0:5]

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
Name: city, dtype: object

### Using .loc[ ]

In [7]:
# Q3: how to use .loc to select the third row of the dataframe?
df.loc[2]

lat               51.478199
lon               -0.446081
date       05/14/2014 10:51
city               Hounslow
country      United Kingdom
Name: 2, dtype: object

In [8]:
# Q4: how to use .loc to select the first row in "country" column?
df.loc[0,["country"]]

country    United Kingdom
Name: 0, dtype: object

In [9]:
# Q5: how to select the first 4 rows of ['city', 'date'] columns?
df.loc[0:3,["city","date"]]

           city              date
0  West Drayton  05/14/2014 09:07
1      Hounslow  05/14/2014 09:22
2      Hounslow  05/14/2014 10:51
3      Hounslow  05/14/2014 11:24

### Using .iloc[ ]

In [10]:
# use .iloc for integer position based indexing
# Q6: how to get the value from the row in position 3 and the column in position 2
df.iloc[2,1]

-0.446081

In [11]:
# Q7: how to use iloc to select every 300th row from a data set
df.iloc[299::300]

            lat        lon              date       city  country
299   41.377076   2.151207  05/19/2014 22:18  Barcelona    Spain
599   50.052415  19.945072  05/31/2014 20:55     Krakow   Poland
899   48.528542   9.063768  06/09/2014 14:58   Tübingen  Germany
1199  41.373631   2.190135  06/17/2014 16:22  Barcelona    Spain
1499  42.208188  20.736031  06/30/2014 08:12    Prizren   Kosovo

## Part 2 <br /> How to select rows by some value(s)

In [12]:
# load a reduced set of gps data
df = pd.read_csv('data/summer-travel-gps-simplified.csv')
df.tail()

           lat        lon              date      city  country
173  41.044556  28.983286  07/08/2014 16:44  Istanbul   Turkey
174  41.008992  28.968268  07/08/2014 20:03  Istanbul   Turkey
175  41.043487  28.985488  07/08/2014 22:18  Istanbul   Turkey
176  40.977637  28.823879  07/09/2014 09:03  Istanbul   Turkey
177  48.357110  11.791346  07/09/2014 13:20    Munich  Germany

In [13]:
df

           lat        lon              date          city         country
0    51.481292  -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1    38.781775  -9.137544  05/14/2014 15:11        Lisbon        Portugal
2    38.711050  -9.139739  05/14/2014 16:40        Lisbon        Portugal
3    38.715637  -9.120558  05/14/2014 18:25        Lisbon        Portugal
4    38.711977  -9.141788  05/14/2014 19:26        Lisbon        Portugal
..         ...        ...               ...           ...             ...
173  41.044556  28.983286  07/08/2014 16:44      Istanbul          Turkey
174  41.008992  28.968268  07/08/2014 20:03      Istanbul          Turkey
175  41.043487  28.985488  07/08/2014 22:18      Istanbul          Turkey
176  40.977637  28.823879  07/09/2014 09:03      Istanbul          Turkey
177  48.357110  11.791346  07/09/2014 13:20        Munich         Germany

[178 rows x 5 columns]

In [14]:
# Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"
df[["city"]].isin(["Munich"])

      city
0    False
1    False
2    False
3    False
4    False
..     ...
173  False
174  False
175  False
176  False
177   True

[178 rows x 1 columns]

In [15]:
# pandas logical operators are: | for or, & for and, ~ for not
# these must be grouped by using parentheses
# Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it. 
df10=df[(df["country"]=="Spain")&(df["city"]!="Barcelona")]
df10

           lat       lon              date                     city country
24   41.303911  2.105931  05/18/2014 22:35     El Prat de Llobregat   Spain
25   41.289946  2.064590  05/18/2014 23:04               Viladecans   Spain
126  41.306752  2.097624  06/12/2014 17:19     El Prat de Llobregat   Spain
127  41.304333  2.072728  06/12/2014 17:49     El Prat de Llobregat   Spain
131  41.358460  2.128701  06/13/2014 11:35  Hospitalet de Llobregat   Spain
138  41.294761  2.059722  06/20/2014 22:15               Viladecans   Spain

In [16]:
# Q11: select rows where either the city is munich, or the country is serbia
df[(df["country"]=="Serbia")|(df["city"]=="Munich")]

           lat        lon              date       city  country
139  44.821164  20.289821  06/21/2014 01:59   Belgrade   Serbia
140  44.820414  20.463465  06/21/2014 18:44   Belgrade   Serbia
141  44.761583  19.577904  06/22/2014 07:58  Slepčević   Serbia
177  48.357110  11.791346  07/09/2014 13:20     Munich  Germany

In [17]:
# Q12: how many observations are west of the prime meridian?
df["lon"][df["lon"]<0].count()

24

In [18]:
# Q13: get all rows that contain a city that starts with the letter G
df[df['city'].str.startswith('G')]

           lat        lon              date         city  country
62   50.273632  18.729429  06/02/2014 06:39      Gliwice   Poland
114  48.282940   8.199630  06/10/2014 13:33       Gutach  Germany
115  48.389029   8.021342  06/10/2014 13:48   Gengenbach  Germany
152  40.187825  20.079303  07/04/2014 17:42  Gjirokastër  Albania

In [19]:
# Q14: how many unique cities and countries in the dataset? 
# Also can you check missing values for the dataframe
df['city'].value_counts()

Barcelona                 28
Istanbul                  12
Prague                    10
Lisbon                     9
Dytiki Ellada              6
                          ..
Tarnowskie Góry County     1
Gliwice                    1
Ruda Slaska                1
Imielin                    1
Munich                     1
Name: city, Length: 91, dtype: int64

In [20]:
df['country'].value_counts()

Spain                     34
Germany                   32
Czech Republic            30
Portugal                  23
Poland                    20
Greece                    12
Turkey                    12
Serbia                     3
Bosnia and Herzegovina     3
Croatia                    3
Albania                    2
United Kingdom             1
Montenegro                 1
Kosovo                     1
Macedonia (FYROM)          1
Name: country, dtype: int64

In [21]:
df.isnull().sum()

lat        0
lon        0
date       0
city       0
country    0
dtype: int64

In [22]:
# Q15: group by country name and show the city names in each of the country
df.groupby('country')[["city"]].apply(lambda x:x[:])

                                    city
country
Albania                151         Berat
                       152   Gjirokastër
Bosnia and Herzegovina 142      Sarajevo
                       143      Sarajevo
                       144        Mostar
...                                  ...
Turkey                 173      Istanbul
                       174      Istanbul
                       175      Istanbul
                       176      Istanbul
United Kingdom         0    West Drayton

[178 rows x 1 columns]

## Part 3 <br /> How to select based on a date-time values

In [23]:
# load the location data set, indexed by the date field
# and, parse the dates so they're no longer strings but now rather Python datetime objects
# this lets us do date and time based operations on the data set
dt = pd.read_csv('data/summer-travel-gps-full.csv', index_col='date', parse_dates=True)
dt.head(10)

                           lat       lon          city         country
date
2014-05-14 09:07:00  51.481292 -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005 -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146 -0.451562      Hounslow  United Kingdom
2014-05-14 12:23:00  51.480146 -0.441103      Hounslow  United Kingdom
2014-05-14 12:38:00  51.479669 -0.441024      Hounslow  United Kingdom
2014-05-14 15:11:00  38.781775 -9.137544        Lisbon        Portugal
2014-05-14 15:25:00  38.774422 -9.129195        Lisbon        Portugal
2014-05-14 15:41:00  38.771939 -9.128911        Lisbon        Portugal

In [24]:
# Q16: is the timestamp index unique? How can you use code to find it? 
dt.index.is_unique

False

In [25]:
dt.duplicated()

date
2014-05-14 09:07:00    False
2014-05-14 09:22:00    False
2014-05-14 10:51:00    False
2014-05-14 11:24:00     True
2014-05-14 11:38:00    False
                       ...
2014-07-09 13:13:00    False
2014-07-09 13:14:00    False
2014-07-09 13:17:00    False
2014-07-09 13:18:00    False
2014-07-09 13:20:00    False
Length: 1759, dtype: bool

In [26]:
# Q17: drop duplicate index 
dt1=dt[~dt.index.duplicated(keep='last')]
dt1

                           lat        lon          city         country
date
2014-05-14 09:07:00  51.481292  -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005  -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199  -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199  -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146  -0.451562      Hounslow  United Kingdom
...                        ...        ...           ...             ...
2014-07-09 13:13:00  48.356013  11.791710        Munich         Germany
2014-07-09 13:14:00  48.356529  11.792183        Munich         Germany
2014-07-09 13:17:00  48.356285  11.791710        Munich         Germany
2014-07-09 13:18:00  48.355328  11.791710        Munich         Germany
2014-07-09 13:20:00  48.357110  11.791346        Munich         Germany

[1758 rows x 4 columns]

In [27]:
dt1.index.is_unique

True

In [28]:
# Q18: create a weekday and a weekend dataframe
dt1['weeknum'] = dt1.index
dt1['weeknum'] = dt1['weeknum'].apply(lambda x: pd.Timestamp(x).weekday())
dt1

/var/folders/9_/0m10cd4j1x11ddwhq6hwrm500000gn/T/ipykernel_16075/519745658.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dt1['weeknum'] = dt1.index
/var/folders/9_/0m10cd4j1x11ddwhq6hwrm500000gn/T/ipykernel_16075/519745658.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dt1['weeknum'] = dt1['weeknum'].apply(lambda x: pd.Timestamp(x).weekday())

,lat,lon,city,country,weeknum
date,,,,,
2014-05-14 09:07:00,51.481292,-0.451011,West Drayton,United Kingdom,2
2014-05-14 09:22:00,51.474005,-0.450999,Hounslow,United Kingdom,2
2014-05-14 10:51:00,51.478199,-0.446081,Hounslow,United Kingdom,2
2014-05-14 11:24:00,51.478199,-0.446081,Hounslow,United Kingdom,2
2014-05-14 11:38:00,51.474146,-0.451562,Hounslow,United Kingdom,2
...,...,...,...,...,...
2014-07-09 13:13:00,48.356013,11.791710,Munich,Germany,2
2014-07-09 13:14:00,48.356529,11.792183,Munich,Germany,2
2014-07-09 13:17:00,48.356285,11.791710,Munich,Germany,2
2014-07-09 13:18:00,48.355328,11.791710,Munich,Germany,2
2014-07-09 13:20:00,48.357110,11.791346,Munich,Germany,2

In [29]:
dt1['weeknum'].unique()

array([2, 3, 4, 5, 6, 0, 1])

In [30]:
weekday = dt1[dt1["weeknum"]<=4]
weekday

,lat,lon,city,country,weeknum
date,,,,,
2014-05-14 09:07:00,51.481292,-0.451011,West Drayton,United Kingdom,2
2014-05-14 09:22:00,51.474005,-0.450999,Hounslow,United Kingdom,2
2014-05-14 10:51:00,51.478199,-0.446081,Hounslow,United Kingdom,2
2014-05-14 11:24:00,51.478199,-0.446081,Hounslow,United Kingdom,2
2014-05-14 11:38:00,51.474146,-0.451562,Hounslow,United Kingdom,2
...,...,...,...,...,...
2014-07-09 13:13:00,48.356013,11.791710,Munich,Germany,2
2014-07-09 13:14:00,48.356529,11.792183,Munich,Germany,2
2014-07-09 13:17:00,48.356285,11.791710,Munich,Germany,2
2014-07-09 13:18:00,48.355328,11.791710,Munich,Germany,2
2014-07-09 13:20:00,48.357110,11.791346,Munich,Germany,2

In [31]:
weekend = dt1[dt1["weeknum"]>4]
weekend

                           lat        lon      city   country  weeknum
date
2014-05-17 00:09:00  38.711824  -9.137308    Lisbon  Portugal        5
2014-05-17 00:39:00  38.711833  -9.137317    Lisbon  Portugal        5
2014-05-17 01:09:00  38.711822  -9.137277    Lisbon  Portugal        5
2014-05-17 01:39:00  38.711823  -9.137273    Lisbon  Portugal        5
2014-05-17 01:54:00  38.711828  -9.137279    Lisbon  Portugal        5
...                        ...        ...       ...       ...      ...
2014-07-06 22:12:00  41.040212  28.988639  Istanbul    Turkey        6
2014-07-06 22:27:00  41.043491  28.985364  Istanbul    Turkey        6
2014-07-06 23:12:00  41.043476  28.985419  Istanbul    Turkey        6
2014-07-06 23:23:00  41.043494  28.985460  Istanbul    Turkey        6
2014-07-06 23:37:00  41.043492  28.985446  Istanbul    Turkey        6

[513 rows x 5 columns]

In [32]:
# Q19: calculate and plot the number of observations each day of the week has
num = dt1.groupby('weeknum')['weeknum'].count()
num

weeknum
0    263
1    254
2    254
3    256
4    218
5    268
6    245
Name: weeknum, dtype: int64